-- MariaDB dump 10.18  Distrib 10.4.17-MariaDB, for Win64 (AMD64)
--
-- Host: localhost    Database: textBoard
-- ------------------------------------------------------
-- Server version	10.4.17-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `textBoard`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `textBoard` /*!40100 DEFAULT CHARACTER SET utf8mb4 */;

USE `textBoard`;

--
-- Table structure for table `article`
--

DROP TABLE IF EXISTS `article`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `article` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `regDate` datetime NOT NULL,
  `updateDate` datetime NOT NULL,
  `title` char(200) NOT NULL,
  `body` text NOT NULL,
  `memberId` int(10) unsigned NOT NULL,
  `boardId` int(10) unsigned NOT NULL,
  `hitCount` int(10) unsigned NOT NULL,
  `likesCount` int(10) unsigned NOT NULL,
  `commentsCount` int(10) unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1186 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `article`
--

LOCK TABLES `article` WRITE;
/*!40000 ALTER TABLE `article` DISABLE KEYS */;
INSERT INTO `article` VALUES (1,'2020-12-17 13:28:21','2021-01-06 17:41:23','자바) Switch 구문','# SWITCH\r\n```java\r\nswitch (변수명) {\r\n          case 조건1:\r\n          실행코드1;\r\n\r\n          case 조건2:\r\n          실행코드2;\r\n\r\n          default:\r\n          실행코드3;\r\n}\r\n```\r\n\r\n변수가 \r\n조건1에 참이라면 실행코드1부터 실행코드3까지 순차적으로 실행\r\n조건2에 참이라면 실행코드2부터 실행코드3까지 순차적으로 실행\r\n조건 1과 조건2에 모두 맞지 않으면 실행코드3만 실행\r\n\r\n\r\n조건에 맞는 실행코드만 실행하고 싶다면 break; 를 넣어준다.\r\n# 예시\r\n```java\r\nint value = 1;\r\n\r\nswitch (value) {\r\n          case 1 :\r\n          System.out.println(\"1\");\r\n          break;\r\n\r\n          case 2 :\r\n          System.out.println(\"2\");\r\n          break;\r\n\r\n          case 3 :\r\n          System.out.println(\"3\");\r\n          break;\r\n\r\n         default :\r\n         System.out.println(\"그 외의 숫자\");\r\n}\r\n```\r\n',1,2,4,0,1),(2,'2020-12-17 15:25:02','2021-01-06 17:41:23','자바) 배열 정렬하는 식','```java\r\nint[] arr = new int[N];\r\n\r\n  for (int i = 0 ; i < arr.length ; i++) {\r\n    for (int j = 0 ; j < arr.length-i-1 ; j++) {\r\n      if(arr[j] < arr[j+1]){\r\n          int temp = arr[j+1];\r\n          arr[j+1] = arr[j];\r\n          arr[j] = temp;\r\n      }  \r\n    }\r\n  }\r\n```\r\n\r\n배열의 앞 뒤 값을  비교해서 작은 값을 뒤로 보내고, 다시 앞 뒤로 비교한다.\r\n이 과정을 반복해서 제일 작은 값은 마지막 위치로 가게 되고 제일 마지막 값은 이미 제일 작은 값이므로 또다시 비교할 필요가 없다.\r\n이 과정을 다시 반복하면 배열은 내림차순으로 정렬된다.',1,2,2,0,0),(3,'2020-12-17 15:25:02','2021-01-06 17:41:23','MySQL) 문자열 합치기 CONCAT','# CONCAT\r\n```MySql\r\nCONCAT(\'문\',\'자\',\'열\')\r\n```\r\n-> \'문자열\'\r\n\r\n',1,2,2,0,0),(4,'2020-12-17 15:25:02','2021-01-06 17:41:23','MySQL) INNER JOIN','# INNER JOIN\r\n```mysql\r\nSELECT * FROM 테이블명1\r\nINNER JOIN 테이블명2\r\nON 테이블명1.컬럼명 = 테이블명2.컬럼명;\r\n```\r\n테이블명1.컬럼과 테이블명2.컬럼의 값이 같은 것들만 합쳐져 나온다.',1,2,2,0,0),(5,'2020-12-20 09:06:01','2021-01-06 17:41:24','자바) 폴더와 하위파일 삭제하는 메소드','# 폴더와 하위파일 삭제하는 메소드\r\n```java\r\npublic static void deleteDir(String filePath) { \r\n\r\n          File deleteFolder = new File(filePath); \r\n\r\n               if(deleteFolder.exists()) { \r\n                   File[] deleteFolderList = deleteFolder.listFiles();\r\n                           for(int i = 0 ; i < deleteFolderList.length; i++) {\r\n                                   if(deleteFolderList[i].isFile()) { \r\n                                        deleteFolderList[i].delete();\r\n                                    } else {\r\n                                     deleteDir(deleteFolderList[i].getPath()); \r\n                                    } \r\n                                    deleteFolderList[i].delete();\r\n                               } deleteFolder.delete(); \r\n                       } \r\n              }\r\n```\r\n',1,2,2,0,0),(6,'2020-12-21 21:45:32','2021-01-06 17:41:24','HTML,CSS) box-sizing 속성','content-box 는 기본으로 적용되는 키워드.\r\n\r\nwidth속성과 height속성이 글자가 들어가는 영역의 크기를 지정하게 만든다.\r\n\r\n(width:100px , height:100px 인 영역에 border,margin,padding등의 요소가 추가되어도 width와 height는 100px로 고정)\r\n\r\n(따라서 태그의 전체 영역은 width,height의 크기에서 border,margin,padding만큼 커지게 된다.)\r\n\r\n \r\n\r\nborder-box 는 width속성과 height속성이 테두리를 포함한 영역의 크기를 지정하게 만든다.\r\n\r\n(width:100px , height:100px 인 영역에 border,margin,padding등의 요소가 추가되면 border와 padding의 크기만큼 width와 height가 줄어든다. margin은 영역의 바깥에 여백을 주는것이기 때문에 상관이 없다.)\r\n\r\n',1,2,2,0,0),(7,'2020-12-21 21:55:28','2021-01-06 17:41:24','JAVASCRIPT) replace를 replaceAll처럼 사용하기','자바스크립트에는 replaceAll 이 없다.\r\nreplaceAll처럼 쓰려면 정규식표현을 사용.\r\n```javascript\r\nstring.replace(\"#\" , \"\"); \r\nstring.replace9(/#/gi , \"\");\r\n```\r\n\r\nreplace 함수에서와 같이 사용하되, 따옴표를 / 슬래시로 대체하고, 뒤에 gi 를 붙이면 replaceAll() 과 같은 기능을 한다.\r\n\r\n* g : 발생할 모든 패턴에 대한 전역 검색\r\n\r\n* i : 대/소문자 구분 안함\r\n\r\n* m : 여러 줄 검색\r\n',1,2,2,0,0),(12,'2020-12-21 09:34:32','2021-01-06 17:41:24','공지사항입니다. 😄','앞으로 풀스택 개발 관련 글이 올라옵니다.\r\n😄😄😄',1,1,2,0,0),(13,'2021-01-05 21:30:14','2021-01-06 17:41:25','게시판 이용 수칙','각 게시판에 맞는 글을 작성해 주세요.',1,1,3,0,0),(14,'2021-01-06 10:36:51','2021-01-06 17:41:25','Vue) Array.prototype.map()','map() 메소드는 배열 내의 모든 요소 각각에 대하여 주어진 함수를 호출한 결과를 모아 새로운 배열을 반환합니다.\r\n\r\n```javascript\r\narray.map(function(row,index){ \r\n  return row * 2;\r\n});\r\n// row 는 처리할 요소 , index 는 처리할 현재 요소의 인덱스\r\n\r\n// map() 메소드는 다음과 같이 사용할 수도 있다.\r\narray.map((row,index) = > {\r\n   return row * 2;\r\n});\r\n```\r\n\r\n',1,2,2,0,0),(15,'2021-01-06 10:40:09','2021-01-06 17:41:25','Vue) Array.prototype.filter()','filter() 메소드는 주어진 함수의 테스트를 통과하는 모든 요소를 모아 새로운 배열로 반환합니다.\r\n\r\n```javascript\r\narray.filter(function(row,index) {\r\n  return row > 10;\r\n});\r\n// row 는 처리할 요소, index 는 현재 처리할 요소의 인덱스\r\n\r\n// filter() 메소드는 다음과 같이 사용할 수도 있다.\r\narray.filter((row,index) => {\r\n  return row > 10;\r\n});\r\n```',1,2,2,0,0),(16,'2021-01-06 10:42:44','2021-01-06 17:41:25','Vue) Array.prototype.some()','some() 메서드는 배열 안의 어떤 요소라도 주어진 판별 함수를 통과하는지 테스트합니다.\r\n```javascript\r\narray.some((row, i) => {\r\n  return row == 15;\r\n});\r\n// row 는 처리할 요소, index 는 현재 처리할 요소의 인덱스\r\n\r\n// some() 메소드는 다음과 같이 사용할 수도 있다.\r\narray.some((row,index) => {\r\n  return row > 10;\r\n});\r\n```',1,2,5,0,0),(17,'2021-01-06 10:43:58','2021-01-06 17:41:26','Vue) Array.prototype.forEach()','forEach() 메서드는 주어진 함수를 배열 요소 각각에 대해 실행합니다.\r\n```javascript\r\narray.forEach((row, i) => {\r\n  console.log(i);\r\n});\r\n// row 는 처리할 요소, index 는 현재 처리할 요소의 인덱스\r\n\r\n// forEach() 메소드는 다음과 같이 사용할 수도 있다.\r\narray.forEach((row,index) => {\r\n  return row > 10;\r\n});\r\n```',1,2,3,0,0),(1005,'2021-01-06 14:13:06','2021-01-06 17:41:26','제목_6','내용',1,3,0,0,0),(1006,'2021-01-06 14:13:06','2021-01-06 17:41:26','제목_10','내용',1,3,0,0,0),(1007,'2021-01-06 14:13:06','2021-01-06 17:41:27','제목_1','내용',1,3,0,0,0),(1008,'2021-01-06 14:13:06','2021-01-06 17:41:27','제목_5','내용',1,3,0,0,0),(1009,'2021-01-06 14:13:06','2021-01-06 17:41:27','제목_3','내용',1,3,0,0,0),(1010,'2021-01-06 14:13:06','2021-01-06 17:41:27','제목_7','내용',1,3,0,0,0),(1011,'2021-01-06 14:13:06','2021-01-06 17:41:28','제목_6','내용',1,3,0,0,0),(1012,'2021-01-06 14:13:06','2021-01-06 17:41:28','제목_7','내용',1,3,0,0,0),(1013,'2021-01-06 14:13:06','2021-01-06 17:41:28','제목_8','내용',1,3,0,0,0),(1014,'2021-01-06 14:13:06','2021-01-06 17:41:29','제목_7','내용',1,3,0,0,0),(1015,'2021-01-06 14:13:06','2021-01-06 17:41:29','제목_2','내용',1,3,0,0,0),(1016,'2021-01-06 14:13:06','2021-01-06 17:41:29','제목_10','내용',1,3,0,0,0),(1017,'2021-01-06 14:13:06','2021-01-06 17:41:30','제목_3','내용',1,3,0,0,0),(1018,'2021-01-06 14:13:06','2021-01-06 17:41:30','제목_5','내용',1,3,0,0,0),(1019,'2021-01-06 14:13:06','2021-01-06 17:41:30','제목_4','내용',1,3,0,0,0),(1020,'2021-01-06 14:13:06','2021-01-06 17:41:31','제목_3','내용',1,3,0,0,0),(1021,'2021-01-06 14:13:06','2021-01-06 17:41:31','제목_6','내용',1,3,0,0,0),(1022,'2021-01-06 14:13:06','2021-01-06 17:41:31','제목_8','내용',1,3,0,0,0),(1023,'2021-01-06 14:13:06','2021-01-06 17:41:32','제목_2','내용',1,3,0,0,0),(1024,'2021-01-06 14:13:06','2021-01-06 17:41:32','제목_4','내용',1,3,0,0,0),(1025,'2021-01-06 14:13:07','2021-01-06 17:41:32','제목_3','내용',1,3,0,0,0),(1026,'2021-01-06 14:13:07','2021-01-06 17:41:33','제목_5','내용',1,3,0,0,0),(1027,'2021-01-06 14:13:07','2021-01-06 17:39:02','제목_6','내용',1,3,0,0,0),(1028,'2021-01-06 14:13:07','2021-01-06 17:39:02','제목_2','내용',1,3,0,0,0),(1029,'2021-01-06 14:13:07','2021-01-06 17:39:03','제목_10','내용',1,3,0,0,0),(1030,'2021-01-06 14:13:07','2021-01-06 17:39:03','제목_7','내용',1,3,0,0,0),(1031,'2021-01-06 14:13:07','2021-01-06 17:39:03','제목_4','내용',1,3,0,0,0),(1032,'2021-01-06 14:13:07','2021-01-06 17:39:04','제목_9','내용',1,3,0,0,0),(1033,'2021-01-06 14:13:07','2021-01-06 17:39:04','제목_2','내용',1,3,0,0,0),(1034,'2021-01-06 14:13:07','2021-01-06 17:39:04','제목_10','내용',1,3,0,0,0),(1035,'2021-01-06 14:13:07','2021-01-06 17:39:04','제목_6','내용',1,3,0,0,0),(1036,'2021-01-06 14:13:07','2021-01-06 17:39:05','제목_10','내용',1,3,0,0,0),(1037,'2021-01-06 14:13:07','2021-01-06 17:39:05','제목_2','내용',1,3,0,0,0),(1038,'2021-01-06 14:13:07','2021-01-06 17:39:05','제목_10','내용',1,3,0,0,0),(1039,'2021-01-06 14:13:07','2021-01-06 17:39:06','제목_2','내용',1,3,0,0,0),(1040,'2021-01-06 14:13:07','2021-01-06 17:39:06','제목_2','내용',1,3,0,0,0),(1041,'2021-01-06 14:13:07','2021-01-06 17:39:06','제목_1','내용',1,3,0,0,0),(1042,'2021-01-06 14:13:07','2021-01-06 17:39:07','제목_7','내용',1,3,0,0,0),(1043,'2021-01-06 14:13:07','2021-01-06 17:39:07','제목_5','내용',1,3,0,0,0),(1044,'2021-01-06 14:13:07','2021-01-06 17:39:07','제목_10','내용',1,3,0,0,0),(1045,'2021-01-06 14:13:07','2021-01-06 17:39:07','제목_7','내용',1,3,0,0,0),(1046,'2021-01-06 14:13:07','2021-01-06 17:39:08','제목_2','내용',1,3,0,0,0),(1047,'2021-01-06 14:13:07','2021-01-06 17:39:08','제목_10','내용',1,3,0,0,0),(1048,'2021-01-06 14:13:07','2021-01-06 17:39:08','제목_5','내용',1,3,0,0,0),(1049,'2021-01-06 14:13:07','2021-01-06 17:39:09','제목_2','내용',1,3,0,0,0),(1050,'2021-01-06 14:13:07','2021-01-06 17:39:09','제목_7','내용',1,3,0,0,0),(1051,'2021-01-06 14:13:07','2021-01-06 17:39:09','제목_6','내용',1,3,0,0,0),(1052,'2021-01-06 14:13:07','2021-01-06 17:39:10','제목_2','내용',1,3,0,0,0),(1053,'2021-01-06 14:13:07','2021-01-06 17:39:10','제목_8','내용',1,3,0,0,0),(1054,'2021-01-06 14:13:07','2021-01-06 17:39:10','제목_5','내용',1,3,0,0,0),(1055,'2021-01-06 14:13:07','2021-01-06 17:39:11','제목_8','내용',1,3,0,0,0),(1056,'2021-01-06 14:13:07','2021-01-06 17:39:11','제목_7','내용',1,3,0,0,0),(1057,'2021-01-06 14:13:07','2021-01-06 17:39:11','제목_2','내용',1,3,0,0,0),(1058,'2021-01-06 14:13:07','2021-01-06 17:39:11','제목_6','내용',1,3,0,0,0),(1059,'2021-01-06 14:13:07','2021-01-06 17:39:12','제목_5','내용',1,3,0,0,0),(1060,'2021-01-06 14:13:07','2021-01-06 17:39:12','제목_5','내용',1,3,0,0,0),(1061,'2021-01-06 14:13:07','2021-01-06 17:39:12','제목_9','내용',1,3,0,0,0),(1062,'2021-01-06 14:13:07','2021-01-06 17:39:13','제목_2','내용',1,3,0,0,0),(1063,'2021-01-06 14:13:07','2021-01-06 17:39:13','제목_10','내용',1,3,0,0,0),(1064,'2021-01-06 14:13:07','2021-01-06 17:39:13','제목_4','내용',1,3,0,0,0),(1065,'2021-01-06 14:13:07','2021-01-06 17:39:14','제목_1','내용',1,3,0,0,0),(1066,'2021-01-06 14:13:07','2021-01-06 17:39:14','제목_10','내용',1,3,0,0,0),(1067,'2021-01-06 14:13:07','2021-01-06 17:39:14','제목_7','내용',1,3,0,0,0),(1068,'2021-01-06 14:13:07','2021-01-06 17:39:15','제목_3','내용',1,3,0,0,0),(1069,'2021-01-06 14:13:07','2021-01-06 17:39:15','제목_7','내용',1,3,0,0,0),(1070,'2021-01-06 14:13:07','2021-01-06 17:39:15','제목_3','내용',1,3,0,0,0),(1071,'2021-01-06 14:13:07','2021-01-06 17:39:16','제목_3','내용',1,3,0,0,0),(1072,'2021-01-06 14:13:07','2021-01-06 17:39:16','제목_5','내용',1,3,0,0,0),(1073,'2021-01-06 14:13:07','2021-01-06 17:39:16','제목_7','내용',1,3,0,0,0),(1074,'2021-01-06 14:13:07','2021-01-06 17:39:17','제목_10','내용',1,3,0,0,0),(1075,'2021-01-06 14:13:07','2021-01-06 17:39:17','제목_9','내용',1,3,0,0,0),(1076,'2021-01-06 14:13:07','2021-01-06 17:39:17','제목_5','내용',1,3,0,0,0),(1077,'2021-01-06 14:13:07','2021-01-06 17:39:17','제목_9','내용',1,3,0,0,0),(1078,'2021-01-06 14:13:07','2021-01-06 17:39:18','제목_7','내용',1,3,0,0,0),(1079,'2021-01-06 14:13:07','2021-01-06 17:39:18','제목_6','내용',1,3,0,0,0),(1080,'2021-01-06 14:13:07','2021-01-06 17:39:18','제목_10','내용',1,3,0,0,0),(1081,'2021-01-06 14:13:07','2021-01-06 17:39:19','제목_2','내용',1,3,0,0,0),(1082,'2021-01-06 14:13:07','2021-01-06 17:39:19','제목_8','내용',1,3,0,0,0),(1083,'2021-01-06 14:13:07','2021-01-06 17:39:19','제목_3','내용',1,3,0,0,0),(1084,'2021-01-06 14:13:07','2021-01-06 17:39:19','제목_10','내용',1,3,0,0,0),(1085,'2021-01-06 14:13:07','2021-01-06 17:39:20','제목_4','내용',1,3,0,0,0),(1086,'2021-01-06 14:13:07','2021-01-06 17:39:20','제목_6','내용',1,3,0,0,0),(1087,'2021-01-06 14:13:07','2021-01-06 17:39:20','제목_8','내용',1,3,0,0,0),(1088,'2021-01-06 14:13:07','2021-01-06 17:39:21','제목_1','내용',1,3,0,0,0),(1089,'2021-01-06 14:13:07','2021-01-06 17:39:21','제목_1','내용',1,3,0,0,0),(1090,'2021-01-06 14:13:07','2021-01-06 17:39:21','제목_2','내용',1,3,0,0,0),(1091,'2021-01-06 14:13:07','2021-01-06 17:39:22','제목_5','내용',1,3,0,0,0),(1092,'2021-01-06 14:13:07','2021-01-06 17:39:22','제목_7','내용',1,3,0,0,0),(1093,'2021-01-06 14:13:07','2021-01-06 17:39:22','제목_3','내용',1,3,0,0,0),(1094,'2021-01-06 14:13:07','2021-01-06 17:39:23','제목_3','내용',1,3,0,0,0),(1095,'2021-01-06 14:13:07','2021-01-06 17:39:23','제목_3','내용',1,3,0,0,0),(1096,'2021-01-06 14:13:07','2021-01-06 17:39:23','제목_6','내용',1,3,0,0,0),(1097,'2021-01-06 14:13:07','2021-01-06 17:39:24','제목_3','내용',1,3,0,0,0),(1098,'2021-01-06 14:13:07','2021-01-06 17:39:24','제목_3','내용',1,3,0,0,0),(1099,'2021-01-06 14:13:07','2021-01-06 17:39:24','제목_8','내용',1,3,0,0,0),(1100,'2021-01-06 14:13:07','2021-01-06 17:39:24','제목_2','내용',1,3,0,0,0),(1101,'2021-01-06 14:13:07','2021-01-06 17:39:25','제목_3','내용',1,3,0,0,0),(1102,'2021-01-06 14:13:07','2021-01-06 17:39:25','제목_9','내용',1,3,0,0,0),(1103,'2021-01-06 14:13:07','2021-01-06 17:39:25','제목_4','내용',1,3,0,0,0),(1104,'2021-01-06 14:13:07','2021-01-06 17:39:26','제목_2','내용',1,3,0,0,0),(1105,'2021-01-06 14:13:07','2021-01-06 17:39:26','제목_10','내용',1,3,0,0,0),(1106,'2021-01-06 14:13:07','2021-01-06 17:39:26','제목_2','내용',1,3,0,0,0),(1107,'2021-01-06 14:13:07','2021-01-06 17:39:27','제목_10','내용',1,3,0,0,0),(1108,'2021-01-06 14:13:07','2021-01-06 17:39:27','제목_3','내용',1,3,0,0,0),(1109,'2021-01-06 14:13:07','2021-01-06 17:39:27','제목_6','내용',1,3,0,0,0),(1110,'2021-01-06 14:13:07','2021-01-06 17:39:27','제목_10','내용',1,3,0,0,0),(1111,'2021-01-06 14:13:07','2021-01-06 17:39:28','제목_10','내용',1,3,0,0,0),(1112,'2021-01-06 14:13:07','2021-01-06 17:39:28','제목_9','내용',1,3,0,0,0),(1113,'2021-01-06 14:13:07','2021-01-06 17:39:28','제목_5','내용',1,3,0,0,0),(1114,'2021-01-06 14:13:07','2021-01-06 17:39:29','제목_7','내용',1,3,0,0,0),(1115,'2021-01-06 14:13:07','2021-01-06 17:39:29','제목_9','내용',1,3,0,0,0),(1116,'2021-01-06 14:13:07','2021-01-06 17:39:29','제목_6','내용',1,3,0,0,0),(1117,'2021-01-06 14:13:07','2021-01-06 17:39:30','제목_3','내용',1,3,0,0,0),(1118,'2021-01-06 14:13:07','2021-01-06 17:39:30','제목_3','내용',1,3,0,0,0),(1119,'2021-01-06 14:13:07','2021-01-06 17:39:30','제목_8','내용',1,3,0,0,0),(1120,'2021-01-06 14:13:07','2021-01-06 17:39:31','제목_2','내용',1,3,0,0,0),(1121,'2021-01-06 14:13:07','2021-01-06 17:39:31','제목_4','내용',1,3,0,0,0),(1122,'2021-01-06 14:13:07','2021-01-06 17:39:31','제목_3','내용',1,3,0,0,0),(1123,'2021-01-06 14:13:07','2021-01-06 17:39:31','제목_5','내용',1,3,0,0,0),(1124,'2021-01-06 14:13:07','2021-01-06 17:39:32','제목_2','내용',1,3,0,0,0),(1125,'2021-01-06 14:13:07','2021-01-06 17:39:32','제목_7','내용',1,3,0,0,0),(1126,'2021-01-06 14:13:07','2021-01-06 17:39:32','제목_6','내용',1,3,0,0,0),(1127,'2021-01-06 14:13:07','2021-01-06 17:39:33','제목_10','내용',1,3,0,0,0),(1128,'2021-01-06 14:13:07','2021-01-06 17:39:33','제목_1','내용',1,3,0,0,0),(1129,'2021-01-06 14:13:07','2021-01-06 17:39:33','제목_7','내용',1,3,0,0,0),(1130,'2021-01-06 14:13:07','2021-01-06 17:39:34','제목_9','내용',1,3,0,0,0),(1131,'2021-01-06 14:13:07','2021-01-06 17:39:34','제목_5','내용',1,3,0,0,0),(1132,'2021-01-06 14:13:07','2021-01-06 17:39:34','제목_6','내용',1,3,0,0,0),(1133,'2021-01-06 14:13:07','2021-01-06 17:39:34','제목_6','내용',1,3,0,0,0),(1134,'2021-01-06 14:13:07','2021-01-06 17:39:35','제목_2','내용',1,3,0,0,0),(1135,'2021-01-06 14:13:07','2021-01-06 17:39:35','제목_10','내용',1,3,0,0,0),(1136,'2021-01-06 14:13:07','2021-01-06 17:39:35','제목_4','내용',1,3,0,0,0),(1137,'2021-01-06 14:13:07','2021-01-06 17:39:36','제목_9','내용',1,3,0,0,0),(1138,'2021-01-06 14:13:07','2021-01-06 17:39:36','제목_1','내용',1,3,0,0,0),(1139,'2021-01-06 14:13:07','2021-01-06 17:39:36','제목_8','내용',1,3,0,0,0),(1140,'2021-01-06 14:13:07','2021-01-06 17:39:37','제목_7','내용',1,3,0,0,0),(1141,'2021-01-06 14:13:07','2021-01-06 17:39:37','제목_1','내용',1,3,0,0,0),(1142,'2021-01-06 14:13:07','2021-01-06 17:39:37','제목_5','내용',1,3,0,0,0),(1143,'2021-01-06 14:13:07','2021-01-06 17:39:38','제목_9','내용',1,3,0,0,0),(1144,'2021-01-06 14:13:07','2021-01-06 17:39:38','제목_2','내용',1,3,0,0,0),(1145,'2021-01-06 14:13:07','2021-01-06 17:39:38','제목_10','내용',1,3,0,0,0),(1146,'2021-01-06 14:13:07','2021-01-06 17:39:38','제목_5','내용',1,3,0,0,0),(1147,'2021-01-06 14:13:07','2021-01-06 17:39:39','제목_5','내용',1,3,0,0,0),(1148,'2021-01-06 14:13:07','2021-01-06 17:39:39','제목_7','내용',1,3,0,0,0),(1149,'2021-01-06 14:13:08','2021-01-06 17:39:39','제목_2','내용',1,3,0,0,0),(1150,'2021-01-06 14:13:08','2021-01-06 17:39:40','제목_8','내용',1,3,0,0,0),(1151,'2021-01-06 14:13:08','2021-01-06 17:39:40','제목_3','내용',1,3,0,0,0),(1152,'2021-01-06 14:13:08','2021-01-06 17:39:40','제목_1','내용',1,3,0,0,0),(1153,'2021-01-06 14:13:08','2021-01-06 17:39:41','제목_4','내용',1,3,0,0,0),(1154,'2021-01-06 14:13:08','2021-01-06 17:39:41','제목_7','내용',1,3,0,0,0),(1155,'2021-01-06 14:13:08','2021-01-06 17:39:41','제목_2','내용',1,3,0,0,0),(1156,'2021-01-06 14:13:08','2021-01-06 17:39:42','제목_9','내용',1,3,0,0,0),(1157,'2021-01-06 14:13:08','2021-01-06 17:39:42','제목_10','내용',1,3,0,0,0),(1158,'2021-01-06 14:13:08','2021-01-06 17:39:42','제목_1','내용',1,3,0,0,0),(1159,'2021-01-06 14:13:08','2021-01-06 17:39:42','제목_5','내용',1,3,0,0,0),(1160,'2021-01-06 14:13:08','2021-01-06 17:39:43','제목_10','내용',1,3,0,0,0),(1161,'2021-01-06 14:13:08','2021-01-06 17:39:43','제목_5','내용',1,3,0,0,0),(1162,'2021-01-06 14:13:08','2021-01-06 17:39:43','제목_6','내용',1,3,0,0,0),(1163,'2021-01-06 14:13:08','2021-01-06 17:39:44','제목_6','내용',1,3,0,0,0),(1164,'2021-01-06 14:13:08','2021-01-06 17:39:44','제목_9','내용',1,3,0,0,0),(1165,'2021-01-06 14:13:08','2021-01-06 17:39:44','제목_8','내용',1,3,0,0,0),(1166,'2021-01-06 14:13:08','2021-01-06 17:39:45','제목_1','내용',1,3,0,0,0),(1167,'2021-01-06 14:13:08','2021-01-06 17:39:45','제목_10','내용',1,3,0,0,0),(1168,'2021-01-06 14:13:08','2021-01-06 17:39:45','제목_5','내용',1,3,0,0,0),(1169,'2021-01-06 14:13:08','2021-01-06 17:39:45','제목_7','내용',1,3,0,0,0),(1170,'2021-01-06 14:13:08','2021-01-06 17:39:46','제목_10','내용',1,3,0,0,0),(1171,'2021-01-06 14:13:08','2021-01-06 17:39:46','제목_9','내용',1,3,0,0,0),(1172,'2021-01-06 14:13:08','2021-01-06 17:39:46','제목_6','내용',1,3,0,0,0),(1173,'2021-01-06 14:13:08','2021-01-06 17:39:47','제목_9','내용',1,3,0,0,0),(1174,'2021-01-06 14:13:08','2021-01-06 17:39:47','제목_9','내용',1,3,0,0,0),(1175,'2021-01-06 14:13:08','2021-01-06 17:39:47','제목_5','내용',1,3,0,0,0),(1176,'2021-01-06 14:13:08','2021-01-06 17:39:48','제목_8','내용',1,3,0,0,0),(1177,'2021-01-06 14:13:08','2021-01-06 17:39:48','제목_3','내용',1,3,0,0,0),(1178,'2021-01-06 14:13:08','2021-01-06 17:39:48','제목_1','내용',1,3,0,0,0),(1179,'2021-01-06 14:13:08','2021-01-06 17:39:49','제목_8','내용',1,3,0,0,0),(1180,'2021-01-06 14:13:08','2021-01-06 17:39:49','제목_6','내용',1,3,0,0,0),(1181,'2021-01-06 14:13:08','2021-01-06 17:39:49','제목_3','내용',1,3,0,0,0),(1182,'2021-01-06 14:13:08','2021-01-06 17:39:49','제목_10','내용',1,3,0,0,0),(1183,'2021-01-06 14:13:08','2021-01-06 17:39:50','제목_8','내용',1,3,0,0,0),(1184,'2021-01-06 14:13:08','2021-01-06 17:39:50','제목_9','내용',1,3,0,0,0);
/*!40000 ALTER TABLE `article` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `articleRecommend`
--

DROP TABLE IF EXISTS `articleRecommend`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `articleRecommend` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `articleId` int(10) unsigned NOT NULL,
  `memberId` int(10) unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `articleRecommend`
--

LOCK TABLES `articleRecommend` WRITE;
/*!40000 ALTER TABLE `articleRecommend` DISABLE KEYS */;
/*!40000 ALTER TABLE `articleRecommend` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `articleReply`
--

DROP TABLE IF EXISTS `articleReply`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `articleReply` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `regDate` datetime NOT NULL,
  `updateDate` datetime NOT NULL,
  `body` text NOT NULL,
  `articleId` int(10) unsigned NOT NULL,
  `memberId` int(10) unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `articleReply`
--

LOCK TABLES `articleReply` WRITE;
/*!40000 ALTER TABLE `articleReply` DISABLE KEYS */;
/*!40000 ALTER TABLE `articleReply` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `board`
--

DROP TABLE IF EXISTS `board`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `board` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `regDate` datetime NOT NULL,
  `updateDate` datetime NOT NULL,
  `name` char(20) NOT NULL,
  `code` char(20) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `board`
--

LOCK TABLES `board` WRITE;
/*!40000 ALTER TABLE `board` DISABLE KEYS */;
INSERT INTO `board` VALUES (1,'2020-12-18 10:17:45','2020-12-18 10:17:45','공지사항','notice'),(2,'2020-12-29 09:31:10','2020-12-29 09:31:13','IT','it'),(3,'2021-01-06 13:16:43','2021-01-06 13:16:45','테스트','test');
/*!40000 ALTER TABLE `board` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ga4DataPagePath`
--

DROP TABLE IF EXISTS `ga4DataPagePath`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ga4DataPagePath` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `regDate` datetime NOT NULL,
  `updateDate` datetime NOT NULL,
  `pagePath` char(100) NOT NULL,
  `hit` int(10) unsigned NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `pagePath` (`pagePath`)
) ENGINE=InnoDB AUTO_INCREMENT=3616 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ga4DataPagePath`
--

LOCK TABLES `ga4DataPagePath` WRITE;
/*!40000 ALTER TABLE `ga4DataPagePath` DISABLE KEYS */;
INSERT INTO `ga4DataPagePath` VALUES (3569,'2021-01-06 17:39:54','2021-01-06 17:39:54','/',39),(3570,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-list-1.html',16),(3571,'2021-01-06 17:39:54','2021-01-06 17:39:54','/statindex.html',12),(3572,'2021-01-06 17:39:54','2021-01-06 17:39:54','/profile.html',10),(3573,'2021-01-06 17:39:54','2021-01-06 17:39:54','/index.html',9),(3574,'2021-01-06 17:39:54','2021-01-06 17:39:54','/guestbook-list-1.html',8),(3575,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-7.html',8),(3576,'2021-01-06 17:39:54','2021-01-06 17:39:54','/notice-list-1.html',7),(3577,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-6.html',6),(3578,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-1.html',5),(3579,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-4.html',5),(3580,'2021-01-06 17:39:54','2021-01-06 17:39:54','/notice-12.html',5),(3581,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-2.html',4),(3582,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-5.html',4),(3583,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-3.html',3),(3584,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-detail-1.html',2),(3585,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-detail-2.html',2),(3586,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-detail-3.html',2),(3587,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-detail-4.html',2),(3588,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-detail-5.html',2),(3589,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-detail-6.html',2),(3590,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-detail-7.html',2),(3591,'2021-01-06 17:39:54','2021-01-06 17:39:54','/notice-detail-12.html',2),(3592,'2021-01-06 17:39:54','2021-01-06 17:39:54','/?dummy=12313',1),(3593,'2021-01-06 17:39:54','2021-01-06 17:39:54','/index.html?dummy=123213213213231',1),(3594,'2021-01-06 17:39:54','2021-01-06 17:39:54','/index.html?dummy=12321321421421214124124',1),(3595,'2021-01-06 17:39:54','2021-01-06 17:39:54','/index.html?dummy=123781294781712894',1),(3596,'2021-01-06 17:39:54','2021-01-06 17:39:54','/index.html?dummy=1237821947218947128947',1),(3597,'2021-01-06 17:39:54','2021-01-06 17:39:54','/index.html?dummy=123891203812471027459721957120957219057091251',1),(3598,'2021-01-06 17:39:54','2021-01-06 17:39:54','/index.html?dummy=123902138921471274812741289471',1),(3599,'2021-01-06 17:39:54','2021-01-06 17:39:54','/index.html?dummy=1239021839120489021',1),(3600,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-1.html?dummy=1233323123123123213123',1),(3601,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-1.html?dummy=123332312312312321312312312312312312321',1),(3602,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-1.html?dummy=123890123891283091238901',1),(3603,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-1.html?dummy=12389128030148051058129051',1),(3604,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-1.html?dummy=1238913891023890128390123890123',1),(3605,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-1.html?dummy=1289301283913',1),(3606,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-1.html?dummy=1290312471892047189047129047',1),(3607,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-1.html?dummy=12903193029301293094028581390',1),(3608,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-7.html?dummy=12389128391278389748127941278591',1),(3609,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-7.html?dummy=12390128391289120457821907529107592017590127590125',1),(3610,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-detail-1.html?dummy=128391238912381293812938129389123891238129381',1),(3611,'2021-01-06 17:39:54','2021-01-06 17:39:54','/it-detail-1.html?dummy=1283912389123812938129381293891238923123213131231238129381',1),(3612,'2021-01-06 17:39:54','2021-01-06 17:39:54','/statindex.html?dummy=1230892130921849082109489048012840291480912841094814',1),(3613,'2021-01-06 17:39:54','2021-01-06 17:39:54','/statindex.html?dummy=12321321472108125',1),(3614,'2021-01-06 17:39:54','2021-01-06 17:39:54','/statindex.html?dummy=12389012478912849120489012489021840948',1),(3615,'2021-01-06 17:39:54','2021-01-06 17:39:54','/test-list-1.html',1);
/*!40000 ALTER TABLE `ga4DataPagePath` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `guestBook`
--

DROP TABLE IF EXISTS `guestBook`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `guestBook` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `regDate` datetime NOT NULL,
  `updateDate` datetime NOT NULL,
  `title` text NOT NULL,
  `memberId` int(10) unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `guestBook`
--

LOCK TABLES `guestBook` WRITE;
/*!40000 ALTER TABLE `guestBook` DISABLE KEYS */;
INSERT INTO `guestBook` VALUES (1,'2020-12-22 13:56:37','2020-12-22 13:56:40','“좋은 프로그래머 대부분은 돈이나 대중에게 받을 찬사를 기대하고 프로그래밍을 하지 않고 프로그래밍이 재미 있어서 한다.”\r\n\r\n- 리누스 베네딕트 토르발스(Linus Benedict Torvalds)',1),(2,'2020-12-22 13:58:06','2020-12-22 13:58:08','\"손으로 10초면 충분히 할 수 있는 일을\r\n컴퓨터로 하루 종일 프로그래밍해서 자동으로 수행할 때,\r\n나는 더할 나위 없이 큰 행복을 느낀다.\"\r\n\r\n- 더글러스 노엘 애덤스(Douglas Noel Adams)',1),(3,'2020-12-22 13:59:14','2020-12-22 13:59:16','\"만약 당신이 코딩을 할 수 있게 된다면, 앉은 자리에서 무언가를 만들어 낼 수 있고, 아무도 당신을 막을 수 없을 것이다.\"\r\n\r\n- 마크 저커버그(Mark Zuckerberg)',1);
/*!40000 ALTER TABLE `guestBook` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `member`
--

DROP TABLE IF EXISTS `member`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `member` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `regDate` datetime NOT NULL,
  `updateDate` datetime NOT NULL,
  `loginId` char(30) NOT NULL,
  `loginPw` varchar(50) NOT NULL,
  `name` char(30) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `member`
--

LOCK TABLES `member` WRITE;
/*!40000 ALTER TABLE `member` DISABLE KEYS */;
INSERT INTO `member` VALUES (1,'2020-12-17 13:27:07','2020-12-17 13:27:07','admin','admin','이명학');
/*!40000 ALTER TABLE `member` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-01-06 19:01:49
